molnija2/CH32V307_uLisp/CH32V307VCT6_ULISP/User/ulisp.cpp
/* uLisp ESP Release 4.7 - www.ulisp.com
   David Johnson-Davies - www.technoblogy.com - 3rd November 2024

   Licensed under the MIT license: https://opensource.org/licenses/MIT
*/





/*  Changes are made in following procedures:

sweep
saveimage
loadimage
delassoc
**place
extern symbol_t Aref2_name ;
sp_push
sp_pop
sp_incf
sp_decf
setf
fn_length
fn_arraydimensions
fn_makunbound
printobject
setup
repl  // 'quit'-variable
buildstring  - changed for x86 machines
*MakeFilename

*/


#include <stdio.h>
#include <string.h>

#include <unistd.h>
#include <stdlib.h>

#include <setjmp.h>
#include <limits.h>
#include <time.h>
#include <math.h>

#include "ulisp.h"

#include "ff.h"
//#include "graph_tcp.h"

//#include "arrays.h"

#include "debug.h"
#include "ch32v30x_usart.h"

#include "board_pins.h"
#include "ILI9488.h"
#include "XPT2046.h"


// Lisp Library
const char LispLibrary[] = R"lisplibrary("
"(ignore-errors (with-sd-card (s "BOOT.L") (eval (read s))))",
")lisplibrary";

/*"(defun load-program (filename)
 (with-sd-card (s filename) (read s)))",
*/
//"(defvar list_editor (load-program "list_editor.l"))",
//"(eval list_editor)"


/*(defvar knowleges (load-program "test_program.l"))

(eval knowleges)

(eval MainProgram)*/

// (quit)


// Includes




// Constants


// Stream names used by printobject
const char serialstream[] = "serial";
const char i2cstream[] = "i2c";
const char spistream[] = "spi";
const char sdstream[] = "sd";
const char wifistream[] = "wifi";
const char stringstream[] = "string";
const char gfxstream[] = "gfx";
const char *const streamname[] = {serialstream, i2cstream, spistream, sdstream, wifistream, stringstream, gfxstream};

// Typedefs







// Global variables

#ifdef BOARD_HAS_PSRAM
object *Workspace WORDALIGNED;
#else
	#ifdef BOARD_HAS_ExternalRAM
	object *Workspace WORDALIGNED = (object *)Bank1_SRAM1_ADDR;
	#else
	object Workspace[WORKSPACESIZE] WORDALIGNED;
	#endif
#endif


jmp_buf toplevel_handler;
jmp_buf *handler = &toplevel_handler;
unsigned int Freespace = 0;
object *Freelist;
unsigned int I2Ccount;
unsigned int TraceFn[TRACEMAX];
unsigned int TraceDepth[TRACEMAX];
builtin_t Context;
uint8_t TraceStart = 0, TraceTop = 0;
symbol_t Backtrace[BACKTRACESIZE];

object *GlobalEnv;
object *GCStack = NULL;
object *GlobalString;
object *GlobalStringTail;
int GlobalStringIndex = 0;
uint8_t PrintCount = 0;
uint8_t BreakLevel = 0;
char LastChar = 0;
char LastPrint = 0;
void* StackBottom;

const char string_mount_error0[17] = "SD mount error\n";
const char string_not_supported[] = "not_supported" ;

const char *string_mount_error = (char*)string_mount_error0 ;

// Flags
volatile flags_t Flags = 1<<PRINTREADABLY; // Set by default

// Forward references
object *tee;
void pfstring (const char *s, pfun_t pfun);

// Error handling

int modbacktrace (int n) {
  return (n+BACKTRACESIZE) % BACKTRACESIZE;
}







/*
  printbacktrace - prints a call backtrace for error messages and break.
*/
void printbacktrace () {
  if (TraceStart != TraceTop) pserial('[');
  int tracesize = modbacktrace(TraceTop-TraceStart);
  for (int i=1; i<=tracesize; i++) {
    printsymbol(symbol(Backtrace[modbacktrace(TraceTop-i)]), pserial);
    if (i!=tracesize) pfstring(" <- ", pserial);
  }
  if (TraceStart != TraceTop) pserial(']');
}

/*
  errorsub - used by all the error routines.
  Prints: "Error: 'fname' string", where fname is the name of the Lisp function in which the error occurred.
*/
void errorsub (symbol_t fname, const char *string) {
  pfl(pserial); pfstring("Error", pserial);
  if (TraceStart != TraceTop) pserial(' ');
  printbacktrace();
  pfstring(": ", pserial);
  if (fname != sym(NIL)) {
    pserial('\'');
    psymbol(fname, pserial);
    pserial('\''); pserial(' ');
  }
  pfstring(string, pserial);
}

void errorend () { GCStack = NULL; longjmp(*handler, 1); }

/*
  errorsym - prints an error message and reenters the REPL.
  Prints: "Error: 'fname' string: symbol", where fname is the name of the user Lisp function in which the error occurred,
  and symbol is the object generating the error.
*/
void errorsym (symbol_t fname, const char *string, object *symbol) {
  if (!tstflag(MUFFLEERRORS)) {
    errorsub(fname, string);
    pserial(':'); pserial(' ');
    printobject(symbol, pserial);
    pln(pserial);
  }
  errorend();
}

/*
  errorsym2 - prints an error message and reenters the REPL.
  Prints: "Error: 'fname' string", where fname is the name of the user Lisp function in which the error occurred.
*/
void errorsym2 (symbol_t fname, const char *string) {
  if (!tstflag(MUFFLEERRORS)) {
    errorsub(fname, string);
    pln(pserial);
  }
  errorend();
}

/*
  error - prints an error message and reenters the REPL.
  Prints: "Error: 'Context' string: symbol", where Context is the name of the built-in Lisp function in which the error occurred,
  and symbol is the object generating the error.
*/
void error (const char *string, object *symbol) {
  errorsym(sym(Context), string, symbol);
}

/*
  error2 - prints an error message and reenters the REPL.
  Prints: "Error: 'Context' string", where Context is the name of the built-in Lisp function in which the error occurred.
*/
void error2 (const char *string) {
  errorsym2(sym(Context), string);
}


unsigned long int millis ()
{
    //clock_t t = clock() ;
    return getMs() ;
}



/*
  formaterr - displays a format error with a ^ pointing to the error
*/
void formaterr (object *formatstr, const char *string, uint8_t p) {
  pln(pserial); indent(4, ' ', pserial); printstring(formatstr, pserial); pln(pserial);
  indent(p+5, ' ', pserial); pserial('^');
  error2(string);
  pln(pserial);
  errorend();
}

// Save space as these are used multiple times
const char notanumber[] = "argument is not a number";
const char notaninteger[] = "argument is not an integer";
const char notastring[] = "argument is not a string";
const char notalist[] = "argument is not a list";
const char notasymbol[] = "argument is not a symbol";
const char notproper[] = "argument is not a proper list";
const char toomanyargs[] = "too many arguments";
const char toofewargs[] = "too few arguments";
const char noargument[] = "missing argument";
const char nostream[] = "missing stream argument";
const char overflow[] = "arithmetic overflow";
const char divisionbyzero[] = "division by zero";
const char indexnegative[] = "index can't be negative";
const char invalidarg[] = "invalid argument";
const char invalidkey[] = "invalid keyword";
const char illegalclause[] = "illegal clause";
const char illegalfn[] = "illegal function";
const char invalidpin[] = "invalid pin";
const char oddargs[] = "odd number of arguments";
const char indexrange[] = "index out of range";
const char canttakecar[] = "can't take car";
const char canttakecdr[] = "can't take cdr";
const char unknownstreamtype[] = "unknown stream type";

// Set up workspace

