molnija2/CH32V307_uLisp/CH32V307VCT6_ULISP/User/ulisp.cpp
/*
  loadimage - loads an image of the workspace from the persistent storage selected for the platform.
*/

unsigned int loadimage (object *arg) {
#ifdef sdcardsupport
  SDBegin();
  FIL File;
  FATFS fatfs;
  //UINT uint_result;
  FRESULT fres;
    //printf("#\n") ;


    char buffer[BUFFERSIZE] ;

  if (stringp(arg)) {
	  MakeFilename(arg, buffer) ;
    arg = NULL;
  } else if (arg == NULL) {
    strcpy(buffer,"ULISP.IMG");
  } else error(invalidarg, arg);

  fres = f_mount(&fatfs, "", 1);
  if(fres != FR_OK)	return -1 ;
  //printf("&\n") ;
  delay(50);

  fres = f_open(&File, buffer,  FA_OPEN_EXISTING | FA_READ);
  if(fres != FR_OK) error2("problem loading from SD card or invalid filename");


  SDReadInt(&File);

  // Change for x86
  object *Wsp_begin = (object *)SDReadInt(&File);
  object *WSP_image = Wsp_begin ;
  int64_t wsp_shift = (uint64_t)(Workspace) ;
  wsp_shift -= (uint64_t)(Wsp_begin) ;

  unsigned int imagesize = SDReadInt(&File);
  GlobalEnv = (object *)(SDReadInt(&File) + wsp_shift ) ;
  GCStack = (object *)(SDReadInt(&File) + wsp_shift ) ;
  for (unsigned int i=0; i<imagesize; i++) {
    object *obj = &Workspace[i];
    car(obj) = (object *)SDReadInt(&File);
    cdr(obj) = (object *)SDReadInt(&File);
  }

  // Change for x86
  /*if(wsp_shift!=0){
    for (unsigned int i=0; i<WORKSPACESIZE-1; i++) {
        object *obj = &Workspace[i];
        object *obj_car = car(obj) ;
        object *obj_cdr = cdr(obj) ;

        if((car(obj)>=WSP_image)&&(car(obj)<&WSP_image[WORKSPACESIZE-1]))
            car(obj) = (object*)((uintptr_t)car(obj) + wsp_shift) ;
        if((cdr(obj)>=WSP_image)&&(cdr(obj)<&WSP_image[WORKSPACESIZE-1]))
            cdr(obj) = (object*)((uintptr_t)cdr(obj) + wsp_shift) ;

        object *obj_carn = car(obj) ;  // For test only
        object *obj_cdrn = cdr(obj) ;  // For test only
    }
  }*/
  // Change for ARRAY2 type
#ifdef DEF_ARRAY2
  for (unsigned int i=0; i<imagesize; i++) {
    object *obj = &Workspace[i];
    if(obj->type == ARRAY2)
    {
        array_desc_t descriptor;
        f_read(&File, &descriptor, sizeof(array_desc_t), &uint_result);
        int fullsize = descriptor.size*descriptor.element_size + sizeof(array_desc_t) ;
        obj->pointer = (uintptr_t)malloc(fullsize);
        *(array_desc_t*)(obj->pointer) = descriptor ;
        uintptr_t array_pointer = (uintptr_t)(obj->pointer) + sizeof (array_desc_t) ;
        f_read(&File, (void*)array_pointer, descriptor.size*descriptor.element_size, &uint_result);
    }
  }
#endif
  fres = f_close(&File);
  if(fres != FR_OK)
  	return -1 ;

  fres =  f_unmount("");
  if(fres != FR_OK)
  	return -1 ;

  gc(NULL, NULL);
  return imagesize;
#elif defined(LITTLEFS)
  if (!LittleFS.begin()) error2("problem mounting LittleFS");
  File file;
  if (stringp(arg)) {
    char buffer[BUFFERSIZE];
    file = LittleFS.open(MakeFilename(arg, buffer), "r");
    if (!file) error2("problem loading from LittleFS or invalid filename");
  }
  else if (arg == NULL) {
    file = LittleFS.open("/ULISP.IMG", "r");
    if (!file) error2("problem loading from LittleFS");
  }
  else error(invalidarg, arg);
  FSRead32(file);
  unsigned int imagesize = FSRead32(file);
  GlobalEnv = (object *)FSRead32(file);
  GCStack = (object *)FSRead32(file);
  for (unsigned int i=0; i<imagesize; i++) {
    object *obj = &Workspace[i];
    car(obj) = (object *)FSRead32(file);
    cdr(obj) = (object *)FSRead32(file);
  }
  file.close();
  gc(NULL, NULL);
  return imagesize;
#elif defined(EEPROMSIZE)
  (void) arg;
  EEPROM.begin(EEPROMSIZE);
  int addr = 0;
  EpromReadInt(&addr); // Skip eval address
  unsigned int imagesize = EpromReadInt(&addr);
  if (imagesize == 0 || imagesize == 0xFFFFFFFF) error2("no saved image");
  GlobalEnv = (object *)EpromReadInt(&addr);
  GCStack = (object *)EpromReadInt(&addr);
  for (unsigned int i=0; i<imagesize; i++) {
    object *obj = &Workspace[i];
    car(obj) = (object *)EpromReadInt(&addr);
    cdr(obj) = (object *)EpromReadInt(&addr);
  }
  gc(NULL, NULL);
  return imagesize;
#else
  (void) arg;
  error2("not available");
  return 0;
#endif
}


/*
  autorunimage - loads and runs an image of the workspace from the persistent storage selected for the platform.
*/
void autorunimage () {
#ifdef sdcardsupport
  SDBegin();
  FATFS fatfs;
  FIL file ;
  FRESULT fres;
  fres = f_mount(&fatfs, "", 1);
  if(fres != FR_OK) error2(string_mount_error);
  fres = f_open(&file, "ULISP.IMG",FA_OPEN_EXISTING | FA_READ);
  if(fres != FR_OK) error2("problem autorunning from SD card");
  object *autorun = (object *)SDReadInt(&file);
  if(fres != FR_OK) return  ;
  fres =  f_unmount("");
  if(fres != FR_OK) return  ;
  if (autorun != NULL) {
    loadimage(NULL);
    apply(autorun, NULL, NULL);
  }
#elif defined(LITTLEFS)
  if (!LittleFS.begin()) error2("problem mounting LittleFS");
  File file = LittleFS.open("/ULISP.IMG", "r");
  if (!file) error2("problem autorunning from LittleFS");
  object *autorun = (object *)FSRead32(file);
  file.close();
  if (autorun != NULL) {
    loadimage(NULL);
    apply(autorun, NULL, NULL);
  }
#elif defined(EEPROMSIZE)
  EEPROM.begin(EEPROMSIZE);
  int addr = 0;
  object *autorun = (object *)EpromReadInt(&addr);
  if (autorun != NULL && (unsigned int)autorun != 0xFFFF) {
    loadimage(NULL);
    apply(autorun, NULL, NULL);
  }
#else
  error2("autorun not available");
#endif
}

// Tracing

/*
  tracing - returns a number between 1 and TRACEMAX if name is being traced, or 0 otherwise
*/
int tracing (symbol_t name) {
  int i = 0;
  while (i < TRACEMAX) {
    if (TraceFn[i] == name) return i+1;
    i++;
  }
  return 0;
}

/*
  trace - enables tracing of symbol name and adds it to the array TraceFn[].
*/
void trace (symbol_t name) {
  if (tracing(name)) error("already being traced", symbol(name));
  int i = 0;
  while (i < TRACEMAX) {
    if (TraceFn[i] == 0) { TraceFn[i] = name; TraceDepth[i] = 0; return; }
    i++;
  }
  error2("already tracing " stringify(TRACEMAX) " functions");
}

/*
  untrace - disables tracing of symbol name and removes it from the array TraceFn[].
*/
void untrace (symbol_t name) {
  int i = 0;
  while (i < TRACEMAX) {
    if (TraceFn[i] == name) { TraceFn[i] = 0; return; }
    i++;
  }
  error("not tracing", symbol(name));
}

// Helper functions

