molnija2/CH32V307_uLisp/CH32V307VCT6_ULISP/User/ulisp.cpp
/*
  (for-millis ([number]) form*)
  Executes the forms and then waits until a total of number milliseconds have elapsed.
  Returns the total number of milliseconds taken.
*/
object *sp_formillis (object *args, object *env) {
  object *param = checkarguments(args, 0, 1);
  SysClockRestart() ;
  unsigned long start = millis();
  unsigned long now, total = 0;
  if (param != NULL) total = checkinteger(eval(first(param), env));
  eval(tf_progn(cdr(args),env), env);
  do {
    now = millis() - start;
    testescape();
  } while (now < total);
  if (now <= INT_MAX) return number(now);
  return nil;
}

/*
  (time form)
  Prints the value returned by the form, and the time taken to evaluate the form
  in milliseconds or seconds.
*/
object *sp_time (object *args, object *env) {
	SysClockRestart() ;
  unsigned long start = millis();
  object *result = eval(first(args), env);
  unsigned long elapsed = millis() - start;
  printobject(result, pserial);
  pfstring("\nTime: ", pserial);
  if (elapsed < 1000) {
    pint(elapsed, pserial);
    pfstring(" ms\n", pserial);
  } else {
    elapsed = elapsed+50;
    pint(elapsed/1000, pserial);
    pserial('.'); pint((elapsed/100)%10, pserial);
    pfstring(" s\n", pserial);
  }
  return bsymbol(NOTHING);
}

/*
  (with-output-to-string (str) form*)
  Returns a string containing the output to the stream variable str.
*/
object *sp_withoutputtostring (object *args, object *env) {
  object *params = checkarguments(args, 1, 1);
  object *var = first(params);
  object *pair = cons(var, stream(STRINGSTREAM, 0));
  push(pair,env);
  object *string = startstring();
  protect(string);
  object *forms = cdr(args);
  eval(tf_progn(forms,env), env);
  unprotect();
  return string;
}

/*
  (with-serial (str port [baud]) form*)
  Evaluates the forms with str bound to a serial-stream using port.
  The optional baud gives the baud rate divided by 100, default 96.
*/
object *sp_withserial (object *args, object *env) {
  object *params = checkarguments(args, 2, 3);
  object *var = first(params);
  int address = checkinteger(eval(second(params), env));
  params = cddr(params);
  int baud = 96;
  if (params != NULL) baud = checkinteger(eval(first(params), env));
  object *pair = cons(var, stream(SERIALSTREAM, address));
  push(pair,env);
  serialbegin(address, baud);
  object *forms = cdr(args);
  object *result = eval(tf_progn(forms,env), env);
  serialend(address);
  return result;
}

/*
  (with-i2c (str [port] address [read-p]) form*)
  Evaluates the forms with str bound to an i2c-stream defined by address.
  If read-p is nil or omitted the stream is written to, otherwise it specifies the number of bytes
  to be read from the stream. If port is omitted it defaults to 0, otherwise it specifies the port, 0 or 1.
*/
object *sp_withi2c (object *args, object *env) {
  object *params = checkarguments(args, 2, 4);
  object *var = first(params);
  int address = checkinteger(eval(second(params), env));
  params = cddr(params);
  if ((address == 0 || address == 1) && params != NULL) {
    address = address * 128 + checkinteger(eval(first(params), env));
    params = cdr(params);
  }
  int read = 0; // Write
  I2Ccount = 0;
  if (params != NULL) {
    object *rw = eval(first(params), env);
    if (integerp(rw)) I2Ccount = rw->integer;
    read = (rw != NULL);
  }
  // Top bit of address is I2C port
  /*TwoWire *port = &Wire;
  #if defined(ULISP_I2C1)
  if (address > 127) port = &Wire1;
  #endif
  I2Cinit(port, 1); // Pullups
  object *pair = cons(var, (I2Cstart(port, address & 0x7F, read)) ? stream(I2CSTREAM, address) : nil);
  push(pair,env);
  object *forms = cdr(args);
  object *result = eval(tf_progn(forms,env), env);
  I2Cstop(port, read);
  return result;*/

  return nil;
}

/*
  (with-spi (str pin [clock] [bitorder] [mode]) form*)
  Evaluates the forms with str bound to an spi-stream.
  The parameters specify the enable pin, clock in kHz (default 4000),
  bitorder 0 for LSBFIRST and 1 for MSBFIRST (default 1), and SPI mode (default 0).
*/
object *sp_withspi (object *args, object *env) {
  object *params = checkarguments(args, 2, 6);
  object *var = first(params);
  params = cdr(params);
  if (params == NULL) error2(nostream);
  int pin = checkinteger(eval(car(params), env));
  object *pair = cons(var, stream(SPISTREAM, pin));
  push(pair,env);
  return nil;
}




static int iFilesOpenedCounter ;

/*
  (with-sd-card (str filename [mode]) form*)
  Evaluates the forms with str bound to an sd-stream reading from or writing to the file filename.
  If mode is omitted the file is read, otherwise 0 means read, 1 write-append, or 2 write-overwrite.
*/
object *sp_withsdcard (object *args, object *env) {
  #ifdef sdcardsupport
  object *params = checkarguments(args, 2, 3);
  object *var = first(params);
  int mode = 0;

  FATFS fatfs;
  FIL fil;
  //UINT uint;
  UINT oflag = FA_OPEN_EXISTING | FA_READ ;
  FRESULT fres;
  //char *cPtr = cProgramBuffer ;
  char fname_complete[256] ;

  if(iFilesOpenedCounter == 0)
  {
	  fres = f_mount(&fatfs, "", 1);
	  if(fres != FR_OK)	return nil ;
  }


  params = cdr(params);
  if (params == NULL) error2("no filename specified");
  builtin_t temp = Context;
  object *filename = eval(first(params), env);
  Context = temp;
  if (!stringp(filename)) error("filename is not a string", filename);
  params = cdr(params);
  SDBegin();

  if (params != NULL && first(params) != NULL) mode = checkinteger(first(params));
  //const char *oflag = "r";

  if (mode == 0) oflag = FA_OPEN_EXISTING | FA_READ;
  else if (mode == 1) oflag = FA_OPEN_APPEND | FA_WRITE;
  else if (mode == 2) oflag = FA_CREATE_ALWAYS | FA_WRITE;
  else if (mode == 3) oflag = FA_OPEN_EXISTING | FA_WRITE | FA_READ ;
  if (mode >= 1) {
    char buffer[BUFFERSIZE];
    fres = f_open(&SDpfile, MakeFilename(filename, buffer),oflag) ;
    if (mode == 3) SDgfile = SDpfile ;
    if(fres != FR_OK) error2("problem writing to SD card or invalid filename");
    iFilesOpenedCounter ++ ;
  } else {
    char buffer[BUFFERSIZE];
    fres = f_open(&SDgfile, MakeFilename(filename, buffer), oflag) ;
    if(fres != FR_OK)  error2("problem reading from SD card or invalid filename");
    iFilesOpenedCounter ++ ;
  }
  object *pair = cons(var, stream(SDSTREAM, 1));
  push(pair,env);
  object *forms = cdr(args);
  object *result = eval(tf_progn(forms,env), env);
  if (mode >= 1)
  {
	    fres = f_close(&SDpfile);
	    iFilesOpenedCounter -- ;
	    if(fres != FR_OK) 	return nil ;
	    if(iFilesOpenedCounter == 0 ) fres =  f_unmount("");
	    if(fres != FR_OK)  	return nil ;

	    //SDpfile = NULL ;
      //if (mode == 3) SDgfile = SDpfile ;
  }else
  {
	    fres = f_close(&SDgfile);
	    iFilesOpenedCounter -- ;
	    if(fres != FR_OK) 	return nil ;
	    if(iFilesOpenedCounter == 0 ) fres =  f_unmount("");
	    if(fres != FR_OK)  	return nil ;

	    //SDgfile = NULL ;
  }
  return result;
  #else
  (void) args, (void) env;
  error2(string_not_supported);
  return nil;
  #endif
}
// Tail-recursive forms

