molnija2/CH32V307_uLisp/CH32V307VCT6_ULISP/User/ulisp.cpp
  if (args != NULL) {
  //  Directory name
    if (stringp(car(args))) {
       cstring(car(args), dirname_string, 256) ;
      test_filename( dirname_string) ;
      if(dirname_string[strlen(dirname_string)-1] == '/') {
          dirname_string[strlen(dirname_string)-1] = 0x0 ;
          type = DEF_TYPE_DIR ;
       } else type = DEF_TYPE_FILE ;
       char *pattern_bgn = strchr(dirname_string,'*') ;
       if (!pattern_bgn)
           pattern_bgn = &dirname_string[strlen(dirname_string)-1] ;
       while ((pattern_bgn!=dirname_string)&&(*pattern_bgn!='/')) pattern_bgn -- ;
       if(*pattern_bgn=='/') {
           pattern_bgn ++ ;
           strcpy(pattern_string, pattern_bgn);
           *pattern_bgn = 0x0 ; // set 0x00 into dirname_string
        } else {
           strcpy(pattern_string, pattern_bgn);
           strcpy(dirname_string, "/");
        }
        if(!(*dirname_string))
           strcpy(dirname_string, "/"); // Dir name "/" restore
     } else {
       error("Incorrect argument",car(args));
       return nil;
     }
  }

  object *result = cons(NULL, NULL);
  object *ptr = result;


  FATFS fatfs;
  DIR dir;
  FRESULT fres;
  FILINFO fno ;


  fres = f_mount(&fatfs, "", 1);
  delay(100);

  if(fres != FR_OK)
  {  pfstring(string_mount_error, pserial); return nil; }

  //printf("Read files %s \n",dirname_string) ;

  fres = f_opendir(&dir, dirname_string );
  if(fres != FR_OK)
  {  pfstring("problem reading from SD card", pserial); return nil; }


  do
  {
	fno.fname[0] = 0 ;
  	fres = f_readdir(&dir, &fno);
  	if(fno.fname[0] != 0x0)
  	{
  		//printf("Attr = %x\n",fno.fattrib) ;
  		//if( ((fno.fattrib == DEF_TYPE_DIR) && (type&DEF_TYPE_DIR))
  		//		|| ((fno.fattrib == DEF_TYPE_FILE) && (type&DEF_TYPE_FILE)) )
  		if((fno.fattrib & type) != 0)
          //if(selection((char*)fno.fname, pattern_string ))
        {
        	  object *filename = lispstring((char*)fno.fname);
        	  cdr(ptr) = cons(filename, NULL);
        	  ptr = cdr(ptr);
        }
     }
  }while((fres == FR_OK)&&(fno.fname[0] != 0x0)) ;

  fres = f_closedir(&dir);
  if(fres != FR_OK)	{  /*pfstring("problem close dir for SD card", pserial);*/ return nil; }
  fres =  f_unmount("");
  if(fres != FR_OK)	{  /*pfstring("problem unmounting SD card", pserial);*/ return nil; }


  return (object *)cdr(result);
#else

  (void) args, (void) env;
  error2(string_not_supported);
  return nil;
#endif
}


// Wi-Fi

/*
  (with-client (str [address port]) form*)
  Evaluates the forms with str bound to a wifi-stream.
*/
object *sp_withclient (object *args, object *env) {
  object *params = checkarguments(args, 1, 3);
  object *var = first(params);
  //char buffer[BUFFERSIZE];
  params = cdr(params);
  int n;
  if (params == NULL) {
    //client = server.available();
    //if (!client) return nil;
    n = 2;
  } /*else {
    object *address = eval(first(params), env);
    object *port = eval(second(params), env);
    int success;
    //if (stringp(address)) success = client.connect(cstring(address, buffer, BUFFERSIZE), checkinteger(port));
    //else if (integerp(address)) success = client.connect(address->integer, checkinteger(port));
    //else error2("invalid address");
    if (!success) return nil;
    n = 1;
  }*/
  object *pair = cons(var, stream(WIFISTREAM, n));
  push(pair,env);
  object *forms = cdr(args);
  object *result = eval(tf_progn(forms,env), env);
  //client.stop();
  return result;
}


extern volatile uint8_t uiRecvIndex, uiRecvReadIndex ;

/*
  (available stream)
  Returns the number of bytes available for reading from the wifi-stream, or zero if no bytes are available.
*/
object *fn_available (object *args, object *env) {
  (void) env;
  int streamtype = SERIALSTREAM;
  int address = 0;

  if (args != NULL && first(args) != NULL) {
    int stream = isstream(first(args));
    streamtype = stream>>8; address = stream & 0xFF;
  }

	if (streamtype == SERIALSTREAM) {
      if (address == 0)
      {
    	  if(uiRecvReadIndex==uiRecvIndex) return nil;
      }
	 else
		error2("invalid stream");
	}

#ifdef wifi_support
	if (streamtype == WIFISTREAM) return nil;
	else
		error2("invalid stream");
#endif

  return /*number(client.available())*/ tee;
}

/*
  (wifi-server)
  Starts a Wi-Fi server running. It returns nil.
*/
object *fn_wifiserver (object *args, object *env) {
  (void) args, (void) env;
  //server.begin();
  return nil;
}

/*
  (wifi-softap ssid [password channel hidden])
  Set up a soft access point to establish a Wi-Fi network.
  Returns the IP address as a string or nil if unsuccessful.
*/
object *fn_wifisoftap (object *args, object *env) {
  (void) env;
  char ssid[33], pass[65];
  //if (args == NULL) return WiFi.softAPdisconnect(true) ? tee : nil;
  object *first = first(args); args = cdr(args);
  /*if (args == NULL) WiFi.softAP(cstring(first, ssid, 33));
  else {
    object *second = first(args);
    args = cdr(args);
    int channel = 1;
    bool hidden = false;
    if (args != NULL) {
      channel = checkinteger(first(args));
      args = cdr(args);
      if (args != NULL) hidden = (first(args) != nil);
    }
    WiFi.softAP(cstring(first, ssid, 33), cstring(second, pass, 65), channel, hidden);
  }
  return iptostring(WiFi.softAPIP());*/
  return nil ;
}

/*
  (connected stream)
  Returns t or nil to indicate if the client on stream is connected.
*/
object *fn_connected (object *args, object *env) {
  (void) env;
  if (isstream(first(args))>>8 != WIFISTREAM) error2("invalid stream");
  //return client.connected() ? tee : nil;
  return nil ;
}

/*
  (wifi-localip)
  Returns the IP address of the local network as a string.
*/
object *fn_wifilocalip (object *args, object *env) {
  (void) args, (void) env;
  //return iptostring(WiFi.localIP());
    return nil ;
}

/*
  (wifi-connect [ssid pass])
  Connects to the Wi-Fi network ssid using password pass. It returns the IP address as a string.
*/
object *fn_wificonnect (object *args, object *env) {
  (void) env;
  char ssid[33], pass[65];
  /*if (args == NULL) { WiFi.disconnect(true); return nil; }
  if (cdr(args) == NULL) WiFi.begin(cstring(first(args), ssid, 33));
  else WiFi.begin(cstring(first(args), ssid, 33), cstring(second(args), pass, 65));
  int result = WiFi.waitForConnectResult();
  if (result == WL_CONNECTED) return iptostring(WiFi.localIP());
  else if (result == WL_NO_SSID_AVAIL) error2("network not found");
  else if (result == WL_CONNECT_FAILED) error2("connection failed");
  else error2("unable to connect");*/
  return nil;
}

