molnija2/CH32V307_uLisp/CH32V307VCT6_ULISP/User/ulisp.cpp
/*
  (draw-char x y char [colour background size])
  Draws the character char with its top left corner at (x,y).
  The character is drawn in a 5 x 7 pixel font in colour against background,
  which default to white and black respectively.
  The character can optionally be scaled by size.
*/
object *fn_drawchar (object *args, object *env) {
  (void) env;
  #ifdef gfxsupport
  uint16_t colour = COLOR_WHITE, bg = COLOR_BLACK, size = 1;
  object *more = cdr(cddr(args));
  if (more != NULL) {
    colour = checkinteger(car(more));
    more = cdr(more);
    if (more != NULL) {
      bg = checkinteger(car(more));
      LCD_settextBkcolor(bg) ;
      more = cdr(more);
      if (more != NULL) size = checkinteger(car(more));
    }
  }

  /*lcd_drawChar(checkinteger(first(args)), checkinteger(second(args)), checkchar(third(args)),
    colour, bg, size);*/

  LCD_gotoxy(checkinteger(first(args)), checkinteger(second(args)));
  LCD_settextcolor(colour);
  LCD_drawChar(checkchar(third(args)));

  #else
  (void) args;
  #endif
  return nil;
}

/*
  (set-cursor x y)
  Sets the start point for text plotting to (x, y).
*/
object *fn_setcursor (object *args, object *env) {
  (void) env;
  #ifdef gfxsupport
  LCD_gotoxy(checkinteger(first(args)), checkinteger(second(args)));
  #else
  (void) args;
  #endif
  return nil;
}

/*
  (set-text-color colour [background])
  Sets the text colour for text plotted using (with-gfx ...).
*/
object *fn_settextcolor (object *args, object *env) {
  (void) env;
  #ifdef gfxsupport
  if (cdr(args) != NULL){
	  LCD_settextcolor(checkinteger(first(args)));
	  LCD_settextBkcolor( checkinteger(second(args)));
      LCD_settextBkMode(1) ;
  }
  else
  {
	  LCD_settextcolor(checkinteger(first(args)));
	  LCD_settextBkMode(0) ;
  }
  #else
  (void) args;
  #endif
  return nil;
}

/*
  (set-text-size scale)
  Scales text by the specified size, default 1.
*/
object *fn_settextsize (object *args, object *env) {
  (void) env;
  #ifdef gfxsupport
  LCD_settextmultsize(checkinteger(first(args)));
  #else
  (void) args;
  #endif
  return nil;
}

/*
  (set-text-wrap boolean)
  Specified whether text wraps at the right-hand edge of the display; the default is t.
*/
object *fn_settextwrap (object *args, object *env) {
  (void) env;
  #ifdef gfxsupport
  LCD_setTextWrap(first(args) != NULL);
  #else
  (void) args;
  #endif
  return nil;
}


/*
  (fill-screen [colour])
  Fills or clears the screen with colour, default black.
*/
object *fn_fillscreen (object *args, object *env) {
  (void) env;
  #ifdef gfxsupport
  uint16_t colour = COLOR_BLACK;
  if (args != NULL) colour = checkinteger(first(args));
  ILI9488_fillScreen(colour); //tcp_fillScreen(colour);
  #else
  (void) args;
  #endif
  return nil;
}

/*
  (set-rotation option)
  Sets the display orientation for subsequent graphics commands; values are 0, 1, 2, or 3.
*/
object *fn_setrotation (object *args, object *env) {
  (void) env;
  #ifdef gfxsupport
  int r = checkinteger(first(args)) ;
  ILI9488_setRotation(r);
  #ifdef touchscreen_support
    TS_setRotation(r) ;
  #endif
  #else
  (void) args;
  #endif
  return nil;
}

/*
  (invert-display boolean)
  Mirror-images the display. 
*/
object *fn_invertdisplay (object *args, object *env) {
  (void) env;
  #ifdef gfxsupport
  ILI9488_invertDisplay(first(args) != NULL);
  #else
  (void) args;
  #endif
  return nil;
}

// Built-in symbol names
const char string0[] = "nil";
const char string1[] = "t";
const char string2[] = "nothing";
const char string3[] = "&optional";
const char string4[] = "*features*";
const char string5[] = ":initial-element";
const char string6[] = ":element-type";
const char string7[] = ":test";
const char string8[] = ":a";
const char string9[] = ":b";
const char string10[] = ":c";
const char string11[] = "bit";
const char string12[] = "&rest";
const char string13[] = "lambda";
const char string14[] = "let";
const char string15[] = "let*";
const char string16[] = "closure";
const char string17[] = "*pc*";
const char string18[] = "quote";
const char string19[] = "defun";
const char string20[] = "defvar";
const char string21[] = "eq";
const char string22[] = "car";
const char string23[] = "first";
const char string24[] = "cdr";
const char string25[] = "rest";
const char string26[] = "nth";
const char string27[] = "aref";
const char string28[] = "char";
const char string29[] = "string";
const char string30[] = "pinmode";
const char string31[] = "digitalwrite";
const char string32[] = "analogread";
const char string33[] = "register";
const char string34[] = "format";
const char string35[] = "or";
const char string36[] = "setq";
const char string37[] = "loop";
const char string38[] = "push";
const char string39[] = "pop";
const char string40[] = "incf";
const char string41[] = "decf";
const char string42[] = "setf";
const char string43[] = "dolist";
const char string44[] = "dotimes";
const char string45[] = "do";
const char string46[] = "do*";
const char string47[] = "trace";
const char string48[] = "untrace";
const char string49[] = "for-millis";
const char string50[] = "time";
const char string51[] = "with-output-to-string";
const char string52[] = "with-serial";
const char string53[] = "with-i2c";
const char string54[] = "with-spi";
const char string55[] = "with-sd-card";
const char string56[] = "progn";
const char string57[] = "if";
const char string58[] = "cond";
const char string59[] = "when";
const char string60[] = "unless";
const char string61[] = "case";
const char string62[] = "and";
const char string63[] = "not";
const char string64[] = "null";
const char string65[] = "cons";
const char string66[] = "atom";
const char string67[] = "listp";
const char string68[] = "consp";
const char string69[] = "symbolp";
const char string70[] = "arrayp";
const char string71[] = "boundp";
const char string72[] = "keywordp";
const char string73[] = "set";
const char string74[] = "streamp";
const char string75[] = "equal";
const char string76[] = "caar";
const char string77[] = "cadr";
const char string78[] = "second";
const char string79[] = "cdar";
const char string80[] = "cddr";
const char string81[] = "caaar";
const char string82[] = "caadr";
const char string83[] = "cadar";
const char string84[] = "caddr";
const char string85[] = "third";
const char string86[] = "cdaar";
const char string87[] = "cdadr";
const char string88[] = "cddar";
const char string89[] = "cdddr";
const char string90[] = "length";
const char string91[] = "array-dimensions";
const char string92[] = "list";
const char string93[] = "copy-list";
const char string94[] = "make-array";
const char string95[] = "reverse";
const char string96[] = "assoc";
const char string97[] = "member";
const char string98[] = "apply";
const char string99[] = "funcall";
const char string100[] = "append";
const char string101[] = "mapc";
const char string102[] = "mapl";
const char string103[] = "mapcar";
const char string104[] = "mapcan";
const char string105[] = "maplist";
const char string106[] = "mapcon";
const char string107[] = "+";
const char string108[] = "-";
const char string109[] = "*";
const char string110[] = "/";
const char string111[] = "mod";
const char string112[] = "rem";
const char string113[] = "1+";
const char string114[] = "1-";
const char string115[] = "abs";
const char string116[] = "random";
const char string117[] = "max";
const char string118[] = "min";
const char string119[] = "/=";
const char string120[] = "=";
const char string121[] = "<";
const char string122[] = "<=";
const char string123[] = ">";
const char string124[] = ">=";
const char string125[] = "plusp";
const char string126[] = "minusp";
const char string127[] = "zerop";
const char string128[] = "oddp";
const char string129[] = "evenp";
const char string130[] = "integerp";
const char string131[] = "numberp";
const char string132[] = "float";
const char string133[] = "floatp";
const char string134[] = "sin";
const char string135[] = "cos";
const char string136[] = "tan";
const char string137[] = "asin";
const char string138[] = "acos";
const char string139[] = "atan";
const char string140[] = "sinh";
const char string141[] = "cosh";
const char string142[] = "tanh";
const char string143[] = "exp";
const char string144[] = "sqrt";
const char string145[] = "log";
const char string146[] = "expt";
const char string147[] = "ceiling";
const char string148[] = "floor";
const char string149[] = "truncate";
const char string150[] = "round";
const char string151[] = "char-code";
const char string152[] = "code-char";
const char string153[] = "characterp";
const char string154[] = "stringp";
const char string155[] = "string=";
const char string156[] = "string<";
const char string157[] = "string>";
const char string158[] = "string/=";
const char string159[] = "string<=";
const char string160[] = "string>=";
const char string161[] = "sort";
const char string162[] = "concatenate";
const char string163[] = "subseq";
const char string164[] = "search";
const char string165[] = "read-from-string";
const char string166[] = "princ-to-string";
const char string167[] = "prin1-to-string";
const char string168[] = "logand";
const char string169[] = "logior";
const char string170[] = "logxor";
const char string171[] = "lognot";
const char string172[] = "ash";
const char string173[] = "logbitp";
const char string174[] = "eval";
const char string175[] = "return";
const char string176[] = "globals";
const char string177[] = "locals";
const char string178[] = "makunbound";
const char string179[] = "break";
const char string180[] = "read";
const char string181[] = "prin1";
const char string182[] = "print";
const char string183[] = "princ";
const char string184[] = "terpri";
const char string185[] = "read-byte";
const char string186[] = "read-line";
const char string187[] = "write-byte";
const char string188[] = "write-string";
const char string189[] = "write-line";
const char string190[] = "restart-i2c";
const char string191[] = "gc";
const char string192[] = "room";
const char string193[] = "backtrace";
const char string194[] = "save-image";
const char string195[] = "load-image";
const char string196[] = "cls";
const char string197[] = "digitalread";
const char string198[] = "analogreadresolution";
const char string199[] = "analogwrite";
const char string200[] = "delay";
const char string201[] = "millis";
const char string202[] = "sleep";
const char string203[] = "note";
const char string204[] = "edit";
const char string205[] = "pprint";
const char string206[] = "pprintall";
const char string207[] = "require";
const char string208[] = "list-library";
const char string209[] = "?";
const char string210[] = "documentation";
const char string211[] = "apropos";
const char string212[] = "apropos-list";
const char string213[] = "unwind-protect";
const char string214[] = "ignore-errors";
const char string215[] = "error";
const char string216[] = "directory";
const char string217[] = "with-client";
const char string218[] = "available";
const char string219[] = "wifi-server";
const char string220[] = "wifi-softap";
const char string221[] = "connected";
const char string222[] = "wifi-localip";
const char string223[] = "wifi-connect";
const char string224[] = "with-gfx";
const char string225[] = "draw-pixel";
const char string226[] = "draw-line";
const char string227[] = "draw-rect";
const char string228[] = "fill-rect";
const char string229[] = "draw-circle";
const char string230[] = "fill-circle";
const char string231[] = "draw-round-rect";
const char string232[] = "fill-round-rect";
const char string233[] = "draw-triangle";
const char string234[] = "fill-triangle";
const char string235[] = "draw-char";
const char string236[] = "set-cursor";
const char string237[] = "set-text-color";
const char string238[] = "set-text-size";
const char string239[] = "set-text-wrap";
const char string240[] = "fill-screen";
const char string241[] = "set-rotation";
const char string242[] = "invert-display";
const char string243[] = ":led-builtin";
const char string244[] = ":high";
const char string245[] = ":low";
const char string246[] = ":input";
const char string247[] = ":input-pullup";
const char string248[] = ":input-pulldown";
const char string249[] = ":output";

