molnija2/CH32V307_uLisp/CH32V307VCT6_ULISP/User/ulisp.cpp
// Documentation strings
const char doc0[] = "nil\n"
"A symbol equivalent to the empty list (). Also represents false.";
const char doc1[] = "t\n"
"A symbol representing true.";
const char doc2[] = "nothing\n"
"A symbol with no value.\n";
//"It is useful if you want to suppress printing the result of evaluating a function.";
const char doc3[] = "&optional\n"
"Can be followed by one or more optional parameters in a lambda or defun parameter list.";
const char doc4[] = "*features*\n"
"Returns a list of keywords representing features supported by this platform.";
const char doc12[] = "&rest\n"
"Can be followed by a parameter in a lambda or defun parameter list,\n"
"and is assigned a list of the corresponding arguments.";
const char doc13[] = "(lambda (parameter*) form*)\n"
"Creates an unnamed function with parameters. The body is evaluated with the parameters as local variables\n"
"whose initial values are defined by the values of the forms after the lambda form.";
const char doc14[] = "(let ((var value) ... ) forms*)\n"
"Declares local variables with values, and evaluates the forms with those local variables.";
const char doc15[] = "(let* ((var value) ... ) forms*)\n"
"Declares local variables with values, and evaluates the forms with those local variables.\n"
"Each declaration can refer to local variables that have been defined earlier in the let*.";
const char doc19[] = "(defun name (parameters) form*)\n"
"Defines a function.";
const char doc20[] = "(defvar variable form)\n"
"Defines a global variable.";
const char doc21[] = "(eq item item)\n"
"Tests whether the two arguments are the same symbol, same character, equal numbers,\n"
"or point to the same cons, and returns t or nil as appropriate.";
const char doc22[] = "(car list)\n"
"Returns the first item in a list.";
const char doc24[] = "(cdr list)\n"
"Returns a list with the first item removed.";
const char doc26[] = "(nth number list)\n"
"Returns the nth item in list, counting from zero.";
const char doc27[] = "(aref array index [index*])\n"
"Returns an element from the specified array.";
const char doc28[] = "(char string n)\n"
"Returns the nth character in a string, counting from zero.";
const char doc29[] = "(string item)\n"
"Converts its argument to a string.";
const char doc30[] = "(pinmode pin mode)\n"
//"Sets the input/output mode of an Arduino pin number, and returns nil.\n"
"The mode parameter can be an integer, a keyword, or t or nil.";
const char doc31[] = "(digitalwrite pin state)\n"
"Sets the state of the specified Arduino pin number.";
const char doc32[] = "(analogread pin)\n"
"Reads the specified Arduino analogue pin number and returns the value.";
const char doc33[] = "(register address [value])\n"
"Reads or writes the value of a peripheral register.\n"
"If value is not specified the function returns the value of the register at address.\n"
"If value is specified the value is written to the register at address and the function returns value.";
const char doc34[] = "(format output controlstring [arguments]*)\n"
"Outputs its arguments formatted according to the format directives in controlstring.";
const char doc35[] = "(or item*)\n"
"Evaluates its arguments until one returns non-nil, and returns its value.";
const char doc36[] = "(setq symbol value [symbol value]*)\n"
"For each pair of arguments assigns the value of the second argument\n"
"to the variable specified in the first argument.";
const char doc37[] = "(loop forms*)\n"
"Executes its arguments repeatedly until one of the arguments calls (return).\n";
//"which then causes an exit from the loop.";
const char doc38[] = "(push item place)\n"
"Modifies the value of place, which should be a list, to add item onto the front of the list,\n"
"and returns the new list.";
const char doc39[] = "(pop place)\n"
"Modifies the value of place, which should be a non-nil list, to remove its first item,\n"
"and returns that item.";
const char doc40[] = "(incf place [number])\n"
"Increments a place, which should have an numeric value, and returns the result.\n"
"The third argument is an optional increment which defaults to 1.";
const char doc41[] = "(decf place [number])\n"
"Decrements a place, which should have an numeric value, and returns the result.\n"
"The third argument is an optional decrement which defaults to 1.";
const char doc42[] = "(setf place value [place value]*)\n"
"For each pair of arguments modifies a place to the result of evaluating value.";
const char doc43[] = "(dolist (var list [result]) form*)\n"
"Sets the local variable var to each element of list in turn, and executes the forms.\n"
"It then returns result, or nil if result is omitted.";
const char doc44[] = "(dotimes (var number [result]) form*)\n"
"Executes the forms number times, with the local variable var set to each integer from 0 to number-1 in turn.\n"
"It then returns result, or nil if result is omitted.";
const char doc45[] = "(do ((var [init [step]])*) (end-test result*) form*)\n"
"Accepts an arbitrary number of iteration vars, which are initialised to init and stepped by step sequentially.\n"
"The forms are executed until end-test is true. It returns result.";
const char doc46[] = "(do* ((var [init [step]])*) (end-test result*) form*)\n"
"Accepts an arbitrary number of iteration vars, which are initialised to init and stepped by step in parallel.\n"
"The forms are executed until end-test is true. It returns result.";
const char doc47[] = "(trace [function]*)\n"
"Turns on tracing of up to TRACEMAX user-defined functions,\n"
"and returns a list of the functions currently being traced.";
const char doc48[] = "(untrace [function]*)\n"
"Turns off tracing of up to TRACEMAX user-defined functions, and returns a list of the functions untraced.\n"
"If no functions are specified it untraces all functions.";
const char doc49[] = "(for-millis ([number]) form*)\n"
"Executes the forms and then waits until a total of number milliseconds have elapsed.\n"
"Returns the total number of milliseconds taken.";
const char doc50[] = "(time form)\n"
"Prints the value returned by the form, and the time taken to evaluate the form\n"
"in milliseconds or seconds.";
const char doc51[] = "(with-output-to-string (str) form*)\n"
"Returns a string containing the output to the stream variable str.";
const char doc52[] = "(with-serial (str port [baud]) form*)\n"
"Evaluates the forms with str bound to a serial-stream using port.\n"
"The optional baud gives the baud rate divided by 100, default 96.";
const char doc53[] = "(with-i2c (str [port] address [read-p]) form*)\n"
"Evaluates the forms with str bound to an i2c-stream defined by address.\n"
"If read-p is nil or omitted the stream is written to, otherwise it specifies the number of bytes\n"
"to be read from the stream. If port is omitted it defaults to 0, otherwise it specifies the port, 0 or 1.";
const char doc54[] = "(with-spi (str pin [clock] [bitorder] [mode]) form*)\n"
"Evaluates the forms with str bound to an spi-stream.\n"
"The parameters specify the enable pin, clock in kHz (default 4000),\n"
"bitorder 0 for LSBFIRST and 1 for MSBFIRST (default 1), and SPI mode (default 0).";
const char doc55[] = "(with-sd-card (str filename [mode]) form*)\n"
"Evaluates the forms with str bound to an sd-stream reading from or writing to the file filename.\n"
"If mode is omitted the file is read, otherwise 0 means read, 1 write-append, or 2 write-overwrite.";
const char doc56[] = "(progn form*)\n"
"Evaluates several forms grouped together into a block, and returns the result of evaluating the last form.";
const char doc57[] = "(if test then [else])\n"
"Evaluates test. If it's non-nil the form then is evaluated and returned;\n"
"otherwise the form else is evaluated and returned.";
const char doc58[] = "(cond ((test form*) (test form*) ... ))\n"
"Each argument is a list consisting of a test optionally followed by one or more forms.\n"
"If the test evaluates to non-nil the forms are evaluated, and the last value is returned as the result of the cond.\n"
"If the test evaluates to nil, none of the forms are evaluated, and the next argument is processed in the same way.";
const char doc59[] = "(when test form*)\n"
"Evaluates the test. If it's non-nil the forms are evaluated and the last value is returned.";
const char doc60[] = "(unless test form*)\n"
"Evaluates the test. If it's nil the forms are evaluated and the last value is returned.";
const char doc61[] = "(case keyform ((key form*) (key form*) ... ))\n"
"Evaluates a keyform to produce a test key, and then tests this against a series of arguments,\n"
"each of which is a list containing a key optionally followed by one or more forms.";
const char doc62[] = "(and item*)\n"
"Evaluates its arguments until one returns nil, and returns the last value.";
const char doc63[] = "(not item)\n"
"Returns t if its argument is nil, or nil otherwise. Equivalent to null.";
const char doc65[] = "(cons item item)\n"
"If the second argument is a list, cons returns a new list with item added to the front of the list.\n"
"If the second argument isn't a list cons returns a dotted pair.";
const char doc66[] = "(atom item)\n"
"Returns t if its argument is a single number, symbol, or nil.";
const char doc67[] = "(listp item)\n"
"Returns t if its argument is a list.";
const char doc68[] = "(consp item)\n"
"Returns t if its argument is a non-null list.";
const char doc69[] = "(symbolp item)\n"
"Returns t if its argument is a symbol.";
const char doc70[] = "(arrayp item)\n"
"Returns t if its argument is an array.";
const char doc71[] = "(boundp item)\n"
"Returns t if its argument is a symbol with a value.";
const char doc72[] = "(keywordp item)\n"
"Returns t if its argument is a built-in or user-defined keyword.";
const char doc73[] = "(set symbol value [symbol value]*)\n"
"For each pair of arguments, assigns the value of the second argument to the value of the first argument.";
const char doc74[] = "(streamp item)\n"
"Returns t if its argument is a stream.";
const char doc75[] = "(equal item item)\n"
"Tests whether the two arguments are the same symbol, same character, equal numbers,\n"
"or point to the same cons, and returns t or nil as appropriate.";
const char doc76[] = "(caar list)";
const char doc77[] = "(cadr list)";
const char doc79[] = "(cdar list)\n"
"Equivalent to (cdr (car list)).";
const char doc80[] = "(cddr list)\n"
"Equivalent to (cdr (cdr list)).";
const char doc81[] = "(caaar list)\n"
"Equivalent to (car (car (car list))).";
const char doc82[] = "(caadr list)\n"
"Equivalent to (car (car (cdar list))).";
const char doc83[] = "(cadar list)\n"
"Equivalent to (car (cdr (car list))).";
const char doc84[] = "(caddr list)\n"
"Equivalent to (car (cdr (cdr list))).";
const char doc86[] = "(cdaar list)\n"
"Equivalent to (cdar (car (car list))).";
const char doc87[] = "(cdadr list)\n"
"Equivalent to (cdr (car (cdr list))).";
const char doc88[] = "(cddar list)\n"
"Equivalent to (cdr (cdr (car list))).";
const char doc89[] = "(cdddr list)\n"
"Equivalent to (cdr (cdr (cdr list))).";
const char doc90[] = "(length item)\n"
"Returns the number of items in a list, the length of a string, or the length of a one-dimensional array.";
const char doc91[] = "(array-dimensions item)\n"
"Returns a list of the dimensions of an array.";
const char doc92[] = "(list item*)\n"
"Returns a list of the values of its arguments.";
const char doc93[] = "(copy-list list)\n"
"Returns a copy of a list.";
const char doc94[] = "(make-array size [:initial-element element] [:element-type 'bit])\n"
"If size is an integer it creates a one-dimensional array with elements from 0 to size-1.\n"
"If size is a list of n integers it creates an n-dimensional array with those dimensions.\n"
"If :element-type 'bit is specified the array is a bit array.";
const char doc95[] = "(reverse list)\n"
"Returns a list with the elements of list in reverse order.";
const char doc96[] = "(assoc key list [:test function])\n"
"Looks up a key in an association list of (key . value) pairs, using eq or the specified test function,\n"
"and returns the matching pair, or nil if no pair is found.";
const char doc97[] = "(member item list [:test function])\n"
"Searches for an item in a list, using eq or the specified test function, and returns the list starting\n"
"from the first occurrence of the item, or nil if it is not found.";
const char doc98[] = "(apply function list)\n"
"Returns the result of evaluating function, with the list of arguments specified by the second parameter.";
const char doc99[] = "(funcall function argument*)\n"
"Evaluates function with the specified arguments.";
const char doc100[] = "(append list*)\n"
"Joins its arguments, which should be lists, into a single list.";
const char doc101[] = "(mapc function list1 [list]*)\n"
"Applies the function to each element in one or more lists, ignoring the results.\n"
"It returns the first list argument.";
const char doc102[] = "(mapl function list1 [list]*)\n"
"Applies the function to one or more lists and then successive cdrs of those lists,\n"
"ignoring the results. It returns the first list argument.";
const char doc103[] = "(mapcar function list1 [list]*)\n"
"Applies the function to each element in one or more lists, and returns the resulting list.";
const char doc104[] = "(mapcan function list1 [list]*)\n"
"Applies the function to each element in one or more lists. The results should be lists,\n"
"and these are destructively concatenated together to give the value returned.";
const char doc105[] = "(maplist function list1 [list]*)\n"
"Applies the function to one or more lists and then successive cdrs of those lists,\n"
"and returns the resulting list.";
const char doc106[] = "(mapcon function list1 [list]*)\n"
"Applies the function to one or more lists and then successive cdrs of those lists,\n"
"and these are destructively concatenated together to give the value returned.";
const char doc107[] = "(+ number*)\n"
"Adds its arguments together.\n"
"If each argument is an integer, and the running total doesn't overflow, the result is an integer,\n"
"otherwise a floating-point number.";
const char doc108[] = "(- number*)\n"
"If there is one argument, negates the argument.\n"
"If there are two or more arguments, subtracts the second and subsequent arguments from the first argument.\n"
"If each argument is an integer, and the running total doesn't overflow, returns the result as an integer,\n"
"otherwise a floating-point number.";
const char doc109[] = "(* number*)\n"
"Multiplies its arguments together.\n"
"If each argument is an integer, and the running total doesn't overflow, the result is an integer,\n"
"otherwise it's a floating-point number.";
const char doc110[] = "(/ number*)\n"
"Divides the first argument by the second and subsequent arguments.\n"
"If each argument is an integer, and each division produces an exact result, the result is an integer;\n"
"otherwise it's a floating-point number.";
const char doc111[] = "(mod number number)\n"
"Returns its first argument modulo the second argument.\n"
"If both arguments are integers the result is an integer; otherwise it's a floating-point number.";
const char doc112[] = "(rem number number)\n"
"Returns the remainder from dividing the first argument by the second argument.\n"
"If both arguments are integers the result is an integer; otherwise it's a floating-point number.";
const char doc113[] = "(1+ number)\n"
"Adds one to its argument and returns it.\n"
"If the argument is an integer the result is an integer if possible;\n"
"otherwise it's a floating-point number.";
const char doc114[] = "(1- number)\n"
"Subtracts one from its argument and returns it.\n"
"If the argument is an integer the result is an integer if possible;\n"
"otherwise it's a floating-point number.";
const char doc115[] = "(abs number)\n"
"Returns the absolute, positive value of its argument.\n"
"If the argument is an integer the result will be returned as an integer if possible,\n"
"otherwise a floating-point number.";
const char doc116[] = "(random number)\n"
"If number is an integer returns a random number between 0 and one less than its argument.\n"
"Otherwise returns a floating-point number between zero and number.";
const char doc117[] = "(max number*)\n"
"Returns the maximum of one or more arguments.";
const char doc118[] = "(min number*)\n"
"Returns the minimum of one or more arguments.";
const char doc119[] = "(/= number*)\n"
"Returns t if none of the arguments are equal, or nil if two or more arguments are equal.";
const char doc120[] = "(= number*)\n"
"Returns t if all the arguments, which must be numbers, are numerically equal, and nil otherwise.";
const char doc121[] = "(< number*)\n"
"Returns t if each argument is less than the next argument, and nil otherwise.";
const char doc122[] = "(<= number*)\n"
"Returns t if each argument is less than or equal to the next argument, and nil otherwise.";
const char doc123[] = "(> number*)\n"
"Returns t if each argument is greater than the next argument, and nil otherwise.";
const char doc124[] = "(>= number*)\n"
"Returns t if each argument is greater than or equal to the next argument, and nil otherwise.";
const char doc125[] = "(plusp number)\n"
"Returns t if the argument is greater than zero, or nil otherwise.";
const char doc126[] = "(minusp number)\n"
"Returns t if the argument is less than zero, or nil otherwise.";
const char doc127[] = "(zerop number)\n"
"Returns t if the argument is zero.";
const char doc128[] = "(oddp number)\n"
"Returns t if the integer argument is odd.";
const char doc129[] = "(evenp number)\n"
"Returns t if the integer argument is even.";
const char doc130[] = "(integerp number)\n"
"Returns t if the argument is an integer.";
const char doc131[] = "(numberp number)\n"
"Returns t if the argument is a number.";
const char doc132[] = "(sfloat_t number)\n"
"Returns its argument converted to a floating-point number.";
const char doc133[] = "(floatp number)\n"
"Returns t if the argument is a floating-point number.";
const char doc134[] = "(sin number)\n"
"Returns sin(number).";
const char doc135[] = "(cos number)\n"
"Returns cos(number).";
const char doc136[] = "(tan number)\n"
"Returns tan(number).";
const char doc137[] = "(asin number)\n"
"Returns asin(number).";
const char doc138[] = "(acos number)\n"
"Returns acos(number).";
const char doc139[] = "(atan number1 [number2])\n"
"Returns the arc tangent of number1/number2, in radians. If number2 is omitted it defaults to 1.";
const char doc140[] = "(sinh number)\n"
"Returns sinh(number).";
const char doc141[] = "(cosh number)\n"
"Returns cosh(number).";
const char doc142[] = "(tanh number)\n"
"Returns tanh(number).";
const char doc143[] = "(exp number)\n"
"Returns exp(number).";
const char doc144[] = "(sqrt number)\n"
"Returns sqrt(number).";
const char doc145[] = "(log number [base])\n"
"Returns the logarithm of number to the specified base. If base is omitted it defaults to e.";
const char doc146[] = "(expt number power)\n"
"Returns number raised to the specified power.\n"
"Returns the result as an integer if the arguments are integers and the result will be within range,\n"
"otherwise a floating-point number.";
const char doc147[] = "(ceiling number [divisor])\n"
"Returns ceil(number/divisor). If omitted, divisor is 1.";
const char doc148[] = "(floor number [divisor])\n"
"Returns floor(number/divisor). If omitted, divisor is 1.";
const char doc149[] = "(truncate number [divisor])\n"
"Returns the integer part of number/divisor. If divisor is omitted it defaults to 1.";
const char doc150[] = "(round number [divisor])\n"
"Returns the integer closest to number/divisor. If divisor is omitted it defaults to 1.";
const char doc151[] = "(char-code character)\n"
"Returns the ASCII code for a character, as an integer.";
const char doc152[] = "(code-char integer)\n"
"Returns the character for the specified ASCII code.";
const char doc153[] = "(characterp item)\n"
"Returns t if the argument is a character and nil otherwise.";
const char doc154[] = "(stringp item)\n"
"Returns t if the argument is a string and nil otherwise.";
const char doc155[] = "(string= string string)\n"
"Returns t if the two strings are the same, or nil otherwise.";
const char doc156[] = "(string< string string)\n"
"Returns the index to the first mismatch if the first string is alphabetically less than the second string,\n"
"or nil otherwise.";
const char doc157[] = "(string> string string)\n"
"Returns the index to the first mismatch if the first string is alphabetically greater than the second string,\n"
"or nil otherwise.";
const char doc158[] = "(string/= string string)\n"
"Returns the index to the first mismatch if the two strings are not the same, or nil otherwise.";
const char doc159[] = "(string<= string string)\n"
"Returns the index to the first mismatch if the first string is alphabetically less than or equal to\n"
"the second string, or nil otherwise.";
const char doc160[] = "(string>= string string)\n"
"Returns the index to the first mismatch if the first string is alphabetically greater than or equal to\n"
"the second string, or nil otherwise.";
const char doc161[] = "(sort list test)\n"
"Destructively sorts list according to the test function, using an insertion sort, and returns the sorted list.";
const char doc162[] = "(concatenate 'string string*)\n"
"Joins together the strings given in the second and subsequent arguments, and returns a single string.";
const char doc163[] = "(subseq seq start [end])\n"
"Returns a subsequence of a list or string from item start to item end-1.";
const char doc164[] = "(search pattern target [:test function])\n"
"Returns the index of the first occurrence of pattern in target, or nil if it's not found.\n"
"The target can be a list or string. If it's a list a test function can be specified; default eq.";
const char doc165[] = "(read-from-string string)\n"
"Reads an atom or list from the specified string and returns it.";
const char doc166[] = "(princ-to-string item)\n"
"Prints its argument to a string, and returns the string.\n";
//"Characters and strings are printed without quotation marks or escape characters.";
const char doc167[] = "(prin1-to-string item [stream])\n"
"Prints its argument to a string or stream with quotation marks and escape, and returns the string.\n";
//"Characters and strings are printed with quotation marks and escape characters.\n";
//"in a format that will be suitable for read-from-string.";
const char doc168[] = "(logand [value*])\n"
"Returns the bitwise & of the values.";
const char doc169[] = "(logior [value*])\n"
"Returns the bitwise | of the values.";
const char doc170[] = "(logxor [value*])\n"
"Returns the bitwise ^ of the values.";
const char doc171[] = "(lognot value)\n"
"Returns the bitwise logical NOT of the value.";
const char doc172[] = "(ash value shift)\n"
"Returns the result of bitwise shifting value by shift bits. If shift is positive, value is shifted to the left.";
const char doc173[] = "(logbitp bit value)\n"
"Returns t if bit number bit in value is a '1', and nil if it is a '0'.";
const char doc174[] = "(eval form*)\n"
"Evaluates its argument an extra time.";
const char doc175[] = "(return [value])\n"
"Exits from a (dotimes ...), (dolist ...), or (loop ...) loop construct and returns value.";
const char doc176[] = "(globals)\n"
"Returns a list of global variables.";
const char doc177[] = "(locals)\n"
"Returns an association list of local variables and their values.";
const char doc178[] = "(makunbound symbol)\n"
"Removes the value of the symbol from GlobalEnv and returns the symbol.";
const char doc179[] = "(break)\n"
"Inserts a breakpoint in the program. When evaluated prints Break! and reenters the REPL.";
const char doc180[] = "(read [stream])\n"
"Reads an atom or list from the serial input or stream and returns it.\n";
//"If stream is specified the item is read from the specified stream.";
const char doc181[] = "(prin1 item [stream])\n"
"Prints its argument, and returns its value.\n"
