molnija2/CH32V307_uLisp/CH32V307VCT6_ULISP/User/ulisp.cpp
"Strings are printed with quotation marks and escape characters.";
const char doc182[] = "(print item [stream])\n"
"Prints its argument with quotation marks and escape characters, on a new line, and followed by a space.\n";
//"If stream is specified the argument is printed to the specified stream.";
const char doc183[] = "(princ item [stream])\n"
"Prints its argument, and returns its value.\n"
"Characters and strings are printed without quotation marks or escape characters.";
const char doc184[] = "(terpri [stream])\n"
"Prints a new line to serial or stream, and returns nil.\n";
//"If stream is specified the new line is written to the specified stream.";
const char doc185[] = "(read-byte stream)\n"
"Reads a byte from a stream and returns it.";
const char doc186[] = "(read-line [stream])\n"
"Reads characters from the serial input or stream up to a newline character, and returns them as a string.";
//", excluding the newline.\n";
//"If stream is specified the line is\n read from the specified stream.";
const char doc187[] = "(write-byte number [stream])\n"
"Writes a byte to a stream.";
const char doc188[] = "(write-string string [stream])\n"
"Writes a string to serial or stream\n";
//. If stream is specified the string is written to the stream.";
const char doc189[] = "(write-line string [stream])\n"
"Writes a string terminated by a newline character.\n";
//" If stream is specified the string is written to the stream.";
const char doc190[] = "(restart-i2c stream [read-p])\n"
"Restarts an i2c-stream.\n"
"If read-p is nil or omitted the stream is written to.\n"
"If read-p is an integer it specifies the number of bytes to be read from the stream.";
const char doc191[] = "(gc [print time])\n"
"Forces a garbage collection and prints the number of objects collected, and the time taken.";
const char doc192[] = "(room)\n"
"Returns the number of free Lisp cells remaining.";
const char doc193[] = "(backtrace [on])\n"
"Sets the state of backtrace according to the boolean flag 'on',\n"
"or with no argument displays the current state of backtrace.";
const char doc194[] = "(save-image [symbol])\n"
"Saves the current uLisp image to non-volatile memory or SD card so it can be loaded using load-image.";
const char doc195[] = "(load-image [filename])\n"
"Loads a saved uLisp image from non-volatile memory or SD card.";
const char doc196[] = "(cls)\n"
"Prints a clear-screen character.";
const char doc197[] = "(digitalread pin)\n"
"Reads the state of the specified Arduino pin number and returns t (high) or nil (low).";
const char doc198[] = "(analogreadresolution bits)\n"
"Specifies the resolution for the analogue inputs on platforms that support it.\n";
//"The default resolution on all platforms is 10 bits.";
const char doc199[] = "(analogwrite pin value)\n"
"Writes the value to the specified Arduino pin number.";
const char doc200[] = "(delay number)\n"
"Delays for a specified number of milliseconds.";
const char doc201[] = "(millis)\n"
"Returns the time in milliseconds that uLisp has been running.";
const char doc202[] = "(sleep secs)\n"
"Puts the processor into a low-power sleep mode for secs.\n";
//"Only supported on some platforms. On other platforms it does delay(1000*secs).";
const char doc203[] = "(note [pin] [note] [octave])\n"
"Generates a square wave on pin.\nNot supported.";
//"note represents the note in the well-tempered scale.\n"
//"The argument octave can specify an octave; default 0.";
const char doc204[] = "(edit 'function)\n"
"Calls the Lisp tree editor to allow you to edit a function definition.";
const char doc205[] = "(pprint item [str])\n"
"Prints its argument, using the pretty printer, to display it formatted in a structured way.\n";
//"If str is specified it prints to the specified stream. It returns no value.";
const char doc206[] = "(pprintall [str])\n"
"Pretty-prints the definition of every function and variable defined in the uLisp workspace.\n";
//"If str is specified it prints to the specified stream. It returns no value.";
const char doc207[] = "(require 'symbol)\n"
"Loads the definition of a function defined with defun, or a variable defined with defvar, from the Lisp Library.\n"
"It returns t if it was loaded, or nil if the symbol is already defined or isn't defined in the Lisp Library.";
const char doc208[] = "(list-library)\n"
"Prints a list of the functions defined in the List Library.";
const char doc209[] = "(? item)\n"
"Prints the documentation string of a built-in or user-defined function.";
const char doc210[] = "(documentation 'symbol [type])\n"
"Returns the documentation string of a built-in or user-defined function. The type argument is ignored.";
const char doc211[] = "(apropos item)\n"
"Prints the user-defined and built-in functions whose names contain the specified string or symbol.";
const char doc212[] = "(apropos-list item)\n"
"Returns a list of user-defined and built-in functions whose names contain the specified string or symbol.";
const char doc213[] = "(unwind-protect form1 [forms]*)\n"
"Evaluates form1 and forms in order and returns the value of form1,\n"
"but guarantees to evaluate forms even if an error occurs in form1.";
const char doc214[] = "(ignore-errors [forms]*)\n"
"Evaluates forms ignoring errors.";
const char doc215[] = "(error controlstring [arguments]*)\n"
"Signals an error. The message is printed by format using the controlstring and arguments.";
const char doc216[] = "(directory)\n"
"Returns a list of the filenames of the files on the SD card.";
const char doc217[] = "(with-client (str [address port]) form*)\n"
"Evaluates the forms with str bound to a wifi-stream.";
const char doc218[] = "(available stream)\n"
"Returns the number of bytes available for reading from the wifi-stream, or zero if no bytes are available.";
const char doc219[] = "(wifi-server)\n"
"Starts a Wi-Fi server running. It returns nil.";
const char doc220[] = "(wifi-softap ssid [password channel hidden])\n"
"Set up a soft access point to establish a Wi-Fi network.\n"
"Returns the IP address as a string or nil if unsuccessful.";
const char doc221[] = "(connected stream)\n"
"Returns t or nil to indicate if the client on stream is connected.";
const char doc222[] = "(wifi-localip)\n"
"Returns the IP address of the local network as a string.";
const char doc223[] = "(wifi-connect [ssid pass])\n"
"Connects to the Wi-Fi network ssid using password pass."
" It returns the IP address as a string.";
const char doc224[] = "(with-gfx (str) form*)\n"
"Evaluates the forms with str bound to an gfx-stream so you can print text\n"
"to the graphics display using the standard uLisp print commands.";
const char doc225[] = "(draw-pixel x y [colour])\n"
"Draws a pixel at coordinates (x,y) in colour, or white if omitted.";
const char doc226[] = "(draw-line x0 y0 x1 y1 [colour])\n"
"Draws a line from (x0,y0) to (x1,y1) in colour, or white if omitted.";
const char doc227[] = "(draw-rect x y w h [colour])\n"
"Draws an outline rectangle with its top left corner at (x,y), with width w,\n"
"and with height h."; // The outline is drawn in colour, or white if omitted.";
const char doc228[] = "(fill-rect x y w h [colour])\n"
"Draws a filled rectangle with its top left corner at (x,y), with width w,\n"
"and with height h."; //" The outline is drawn in colour, or white if omitted.";
const char doc229[] = "(draw-circle x y r [colour])\n"
"Draws an outline circle with its centre at (x, y) and with radius r.\n";
//"The circle is drawn in colour, or white if omitted.";
const char doc230[] = "(fill-circle x y r [colour])\n"
"Draws a filled circle with its centre at (x, y) and with radius r.\n";
//"The circle is drawn in colour, or white if omitted.";
const char doc231[] = "(draw-round-rect x y width heigth radius [colour])\n"
"Draws an outline rounded rectangle";
//"Draws an outline rounded rectangle with its top left corner at (x,y), with width w,\n"
//"height h, and corner radius radius. The outline is drawn in colour, or white if omitted.";
const char doc232[] = "(fill-round-rect x y width heigth radius [colour])\n"
"Draws a filled rounded rectangle";
//"Draws a filled rounded rectangle with its top left corner at (x,y), with width w,\n"
//"height h, and corner radius radius. The outline is drawn in colour, or white if omitted.";
const char doc233[] = "(draw-triangle x0 y0 x1 y1 x2 y2 [colour])\n"
"Draws an outline triangle between (x1,y1), (x2,y2), and (x3,y3).\n";
//"The outline is drawn in colour, or white if omitted.";
const char doc234[] = "(fill-triangle x0 y0 x1 y1 x2 y2 [colour])\n"
"Draws a filled triangle between (x1,y1), (x2,y2), and (x3,y3).\n";
//"The outline is drawn in colour, or white if omitted.";
const char doc235[] = "(draw-char x y char [colour background size])\n"
"Draws the character char in a 5 x 7 pixel font with its top left corner at (x,y).\n"
//"The character is drawn in a 5 x 7 pixel font in colour against background,\n"
//"which default to white and black respectively.\n"
"The character can optionally be scaled by size.";
const char doc236[] = "(set-cursor x y)\n"
"Sets the start point for text plotting to (x, y).";
const char doc237[] = "(set-text-color colour [background])\n"
"Sets the text colour for text plotted using (with-gfx ...).";
const char doc238[] = "(set-text-size scale)\n"
"Scales text by the specified size, default 1.";
const char doc239[] = "(set-text-wrap boolean)\n"
"Specified whether text wraps at the right-hand edge of the display; the default is t.";
const char doc240[] = "(fill-screen [colour])\n"
"Fills or clears the screen with colour, default black.";
const char doc241[] = "(set-rotation option)\n"
"Sets the display orientation for subsequent graphics commands; values are 0, 1, 2, or 3.";
const char doc242[] = "(invert-display boolean)\n"
"Mirror-images the display.";

// Built-in symbol lookup table
const tbl_entry_t lookup_table[] = {
  { string0, NULL, 0000, doc0 },
  { string1, NULL, 0000, doc1 },
  { string2, NULL, 0000, doc2 },
  { string3, NULL, 0000, doc3 },
  { string4, NULL, 0000, doc4 },
  { string5, NULL, 0000, NULL },
  { string6, NULL, 0000, NULL },
  { string7, NULL, 0000, NULL },
  { string8, NULL, 0000, NULL },
  { string9, NULL, 0000, NULL },
  { string10, NULL, 0000, NULL },
  { string11, NULL, 0000, NULL },
  { string12, NULL, 0000, doc12 },
  { string13, NULL, 0017, doc13 },
  { string14, NULL, 0017, doc14 },
  { string15, NULL, 0017, doc15 },
  { string16, NULL, 0017, NULL },
  { string17, NULL, 0007, NULL },
  { string18, sp_quote, 0311, NULL },
  { string19, sp_defun, 0327, doc19 },
  { string20, sp_defvar, 0313, doc20 },
  { string21, fn_eq, 0222, doc21 },
  { string22, fn_car, 0211, doc22 },
  { string23, fn_car, 0211, NULL },
  { string24, fn_cdr, 0211, doc24 },
  { string25, fn_cdr, 0211, NULL },
  { string26, fn_nth, 0222, doc26 },
  { string27, fn_aref, 0227, doc27 },
  { string28, fn_char, 0222, doc28 },
  { string29, fn_stringfn, 0211, doc29 },
  { string30, fn_pinmode, 0222, doc30 },
  { string31, fn_digitalwrite, 0222, doc31 },
  { string32, fn_analogread, 0211, doc32 },
  { string33, fn_register, 0212, doc33 },
  { string34, fn_format, 0227, doc34 },
  // Assembler
  { stringASM, sp_defcode, 0307, docASM },
  { string35, sp_or, 0307, doc35 },
  { string36, sp_setq, 0327, doc36 },
  { string37, sp_loop, 0307, doc37 },
  { string38, sp_push, 0322, doc38 },
  { string39, sp_pop, 0311, doc39 },
  { string40, sp_incf, 0312, doc40 },
  { string41, sp_decf, 0312, doc41 },
  { string42, sp_setf, 0327, doc42 },
  { string43, sp_dolist, 0317, doc43 },
  { string44, sp_dotimes, 0317, doc44 },
  { string45, sp_do, 0327, doc45 },
  { string46, sp_dostar, 0317, doc46 },
  { string47, sp_trace, 0301, doc47 },
  { string48, sp_untrace, 0301, doc48 },
  { string49, sp_formillis, 0317, doc49 },
  { string50, sp_time, 0311, doc50 },
  { string51, sp_withoutputtostring, 0317, doc51 },
  { string52, sp_withserial, 0317, doc52 },
  { string53, sp_withi2c, 0317, doc53 },
  { string54, sp_withspi, 0317, doc54 },
  { string55, sp_withsdcard, 0327, doc55 },
  { string56, tf_progn, 0107, doc56 },
  { string57, tf_if, 0123, doc57 },
  { string58, tf_cond, 0107, doc58 },
  { string59, tf_when, 0117, doc59 },
  { string60, tf_unless, 0117, doc60 },
  { string61, tf_case, 0117, doc61 },
  { string62, tf_and, 0107, doc62 },
  { string63, fn_not, 0211, doc63 },
  { string64, fn_not, 0211, NULL },
  { string65, fn_cons, 0222, doc65 },
  { string66, fn_atom, 0211, doc66 },
  { string67, fn_listp, 0211, doc67 },
  { string68, fn_consp, 0211, doc68 },
  { string69, fn_symbolp, 0211, doc69 },
  { string70, fn_arrayp, 0211, doc70 },
  { string71, fn_boundp, 0211, doc71 },
  { string72, fn_keywordp, 0211, doc72 },
  { string73, fn_setfn, 0227, doc73 },
  { string74, fn_streamp, 0211, doc74 },
  { string75, fn_equal, 0222, doc75 },
  /*{ string76, fn_caar, 0211, doc76 },
  { string77, fn_cadr, 0211, doc77 },
  { string78, fn_cadr, 0211, NULL },
  { string79, fn_cdar, 0211, doc79 },
  { string80, fn_cddr, 0211, doc80 },
  { string81, fn_caaar, 0211, doc81 },
  { string82, fn_caadr, 0211, doc82 },
  { string83, fn_cadar, 0211, doc83 },
  { string84, fn_caddr, 0211, doc84 },
  { string85, fn_caddr, 0211, NULL },
  { string86, fn_cdaar, 0211, doc86 },
  { string87, fn_cdadr, 0211, doc87 },
  { string88, fn_cddar, 0211, doc88 },
  { string89, fn_cdddr, 0211, doc89 },*/
  { string90, fn_length, 0211, doc90 },
  { string91, fn_arraydimensions, 0211, doc91 },
  { string92, fn_list, 0207, doc92 },
  { string93, fn_copylist, 0211, doc93 },
  { string94, fn_makearray, 0215, doc94 },
  { string95, fn_reverse, 0211, doc95 },
  { string96, fn_assoc, 0224, doc96 },
  { string97, fn_member, 0224, doc97 },
  { string98, fn_apply, 0227, doc98 },
  { string99, fn_funcall, 0217, doc99 },
  { string100, fn_append, 0207, doc100 },
  { string101, fn_mapc, 0227, doc101 },
  { string102, fn_mapl, 0227, doc102 },
  { string103, fn_mapcar, 0227, doc103 },
  { string104, fn_mapcan, 0227, doc104 },
  { string105, fn_maplist, 0227, doc105 },
  { string106, fn_mapcon, 0227, doc106 },
  { string107, fn_add, 0207, doc107 },
  { string108, fn_subtract, 0217, doc108 },
  { string109, fn_multiply, 0207, doc109 },
  { string110, fn_divide, 0217, doc110 },
  { string111, fn_mod, 0222, doc111 },
  { string112, fn_rem, 0222, doc112 },
  { string113, fn_oneplus, 0211, doc113 },
  { string114, fn_oneminus, 0211, doc114 },
  { string115, fn_abs, 0211, doc115 },
  { string116, fn_random, 0211, doc116 },
  { string117, fn_maxfn, 0217, doc117 },
  { string118, fn_minfn, 0217, doc118 },
  { string119, fn_noteq, 0217, doc119 },
  { string120, fn_numeq, 0217, doc120 },
  { string121, fn_less, 0217, doc121 },
  { string122, fn_lesseq, 0217, doc122 },
  { string123, fn_greater, 0217, doc123 },
  { string124, fn_greatereq, 0217, doc124 },
  { string125, fn_plusp, 0211, doc125 },
  { string126, fn_minusp, 0211, doc126 },
  { string127, fn_zerop, 0211, doc127 },
  { string128, fn_oddp, 0211, doc128 },
  { string129, fn_evenp, 0211, doc129 },
  { string130, fn_integerp, 0211, doc130 },
  { string131, fn_numberp, 0211, doc131 },
  { string132, fn_floatfn, 0211, doc132 },
  { string133, fn_floatp, 0211, doc133 },
  { string134, fn_sin, 0211, doc134 },
  { string135, fn_cos, 0211, doc135 },
  { string136, fn_tan, 0211, doc136 },
  { string137, fn_asin, 0211, doc137 },
  { string138, fn_acos, 0211, doc138 },
  { string139, fn_atan, 0212, doc139 },
  { string140, fn_sinh, 0211, doc140 },
  { string141, fn_cosh, 0211, doc141 },
  { string142, fn_tanh, 0211, doc142 },
  { string143, fn_exp, 0211, doc143 },
  { string144, fn_sqrt, 0211, doc144 },
  { string145, fn_log, 0212, doc145 },
  { string146, fn_expt, 0222, doc146 },
  { string147, fn_ceiling, 0212, doc147 },
  { string148, fn_floor, 0212, doc148 },
  { string149, fn_truncate, 0212, doc149 },
  { string150, fn_round, 0212, doc150 },
  { string151, fn_charcode, 0211, doc151 },
  { string152, fn_codechar, 0211, doc152 },
  { string153, fn_characterp, 0211, doc153 },
  { string154, fn_stringp, 0211, doc154 },
  { string155, fn_stringeq, 0222, doc155 },
  { string156, fn_stringless, 0222, doc156 },
  { string157, fn_stringgreater, 0222, doc157 },
  { string158, fn_stringnoteq, 0222, doc158 },
  { string159, fn_stringlesseq, 0222, doc159 },
  { string160, fn_stringgreatereq, 0222, doc160 },
  { string161, fn_sort, 0222, doc161 },
  { string162, fn_concatenate, 0217, doc162 },
  { string163, fn_subseq, 0223, doc163 },
  { string164, fn_search, 0224, doc164 },
  { string165, fn_readfromstring, 0211, doc165 },
  { string166, fn_princtostring, 0211, doc166 },
  { string167, fn_prin1tostring, 0211, doc167 },
  { string168, fn_logand, 0207, doc168 },
  { string169, fn_logior, 0207, doc169 },
  { string170, fn_logxor, 0207, doc170 },
  { string171, fn_lognot, 0211, doc171 },
  { string172, fn_ash, 0222, doc172 },
  { string173, fn_logbitp, 0222, doc173 },
  { string174, fn_eval, 0211, doc174 },
  { string175, fn_return, 0201, doc175 },
  { string176, fn_globals, 0200, doc176 },
  { string177, fn_locals, 0200, doc177 },
  { string178, fn_makunbound, 0211, doc178 },
  { string179, fn_break, 0200, doc179 },
  { string180, fn_read, 0201, doc180 },
  { string181, fn_prin1, 0212, doc181 },
  { string182, fn_print, 0212, doc182 },
  { string183, fn_princ, 0212, doc183 },
  { string184, fn_terpri, 0201, doc184 },
  { string185, fn_readbyte, 0202, doc185 },
  { string186, fn_readline, 0201, doc186 },
  { string187, fn_writebyte, 0212, doc187 },
  { string188, fn_writestring, 0212, doc188 },
  { string189, fn_writeline, 0212, doc189 },
  { string190, fn_restarti2c, 0212, doc190 },
  { string191, fn_gc, 0201, doc191 },
  { string192, fn_room, 0200, doc192 },
  { string193, fn_backtrace, 0201, doc193 },
  { string194, fn_saveimage, 0201, doc194 },
  { string195, fn_loadimage, 0201, doc195 },
  { string196, fn_cls, 0200, doc196 },
  { string197, fn_digitalread, 0211, doc197 },
  { string198, fn_analogreadresolution, 0211, doc198 },
  { string199, fn_analogwrite, 0222, doc199 },
  { string200, fn_delay, 0211, doc200 },
  { string201, fn_millis, 0200, doc201 },
  { string202, fn_sleep, 0201, doc202 },
  { string203, fn_note, 0203, doc203 },
  { string204, fn_edit, 0211, doc204 },
  { string205, fn_pprint, 0212, doc205 },
  { string206, fn_pprintall, 0201, doc206 },
  { string207, fn_require, 0211, doc207 },
  { string208, fn_listlibrary, 0200, doc208 },
  { string209, sp_help, 0311, doc209 },
  { string210, fn_documentation, 0212, doc210 },
  { string211, fn_apropos, 0211, doc211 },
  { string212, fn_aproposlist, 0211, doc212 },
  { string213, sp_unwindprotect, 0307, doc213 },
  { string214, sp_ignoreerrors, 0307, doc214 },
  { string215, sp_error, 0317, doc215 },
  { string216, fn_directory, 0201, doc216 },
#if defined(ULISP_WIFI)
  { string218, fn_available, 0211, doc218 },
  { string217, sp_withclient, 0317, doc217 },
  { string219, fn_wifiserver, 0200, doc219 },
  { string220, fn_wifisoftap, 0204, doc220 },
  { string221, fn_connected, 0211, doc221 },
  { string222, fn_wifilocalip, 0200, doc222 },
  { string223, fn_wificonnect, 0203, doc223 },
#endif
  { string224, sp_withgfx, 0317, doc224 },
  { string225, fn_drawpixel, 0223, doc225 },
  { string226, fn_drawline, 0245, doc226 },
  { string227, fn_drawrect, 0245, doc227 },
  { string228, fn_fillrect, 0245, doc228 },
  { string229, fn_drawcircle, 0234, doc229 },
  { string230, fn_fillcircle, 0234, doc230 },
  { string231, fn_drawroundrect, 0256, doc231 },
  { string232, fn_fillroundrect, 0256, doc232 },
  { string233, fn_drawtriangle, 0267, doc233 },
  { string234, fn_filltriangle, 0267, doc234 },
  { string235, fn_drawchar, 0236, doc235 },
  { string236, fn_setcursor, 0222, doc236 },
  { string237, fn_settextcolor, 0212, doc237 },
  { string238, fn_settextsize, 0211, doc238 },
  { string239, fn_settextwrap, 0211, doc239 },
  { string240, fn_fillscreen, 0201, doc240 },
  { string241, fn_setrotation, 0211, doc241 },
  { string242, fn_invertdisplay, 0211, doc242 },
  { string243, (fn_ptr_type)LED_BUILTIN, 0, NULL },
  { string244, (fn_ptr_type)HIGH, DIGITALWRITE, NULL },
  { string245, (fn_ptr_type)LOW, DIGITALWRITE, NULL },
  { string246, (fn_ptr_type)INPUT, PINMODE, NULL },
  { string247, (fn_ptr_type)INPUT_PULLUP, PINMODE, NULL },
  { string248, (fn_ptr_type)INPUT_PULLDOWN, PINMODE, NULL },
  { string249, (fn_ptr_type)OUTPUT, PINMODE, NULL },
};



