molnija2/CH32V307_uLisp/CH32V307VCT6_ULISP/User/ulisp.cpp
void initTouchscreen ()
{
  #ifdef touchscreen_support
	TS2046_Init() ;
  #endif
}

extern char *file_name ;
int mainprog_loadedflag;


void setup () {
  //Serial.begin(9600);
	init_extensions();

	SysClockRestart() ;
  //int start = millis();
  //while ((millis() - start) < 100) { /*if (Serial) break;*/ }
  #ifdef BOARD_HAS_PSRAM
  /*if (!psramInit()) { Serial.print("the PSRAM couldn't be initialized"); for(;;); }
  Workspace = (object*) ps_malloc(WORKSPACESIZE*8);
  if (!Workspace) { Serial.print("the Workspace couldn't be allocated"); for(;;); }*/

  Workspace = (object*) malloc(WORKSPACESIZE*sizeof(object));
  #else
	#ifdef BOARD_HAS_ExternalRAM
  	  Workspace = (object *)Bank1_SRAM1_ADDR;
	#endif
  #endif
  int stackhere = 0; StackBottom = &stackhere;


#ifdef DEF_ARRAY2
  InitArray2() ;  //  Change for ARRAY2
#endif

  initworkspace();
  initenv();
  initsleep();
  initgfx();
  initTouchscreen() ;
  pfstring("uLisp 4.7 ", pserial); pln(pserial);
}




void DeleteWorkspace()
{
#ifdef BOARD_HAS_PSRAM
//if (!psramInit()) { Serial.print("the PSRAM couldn't be initialized"); for(;;); }
    if( Workspace)
    {   free(Workspace) ;
        Workspace = NULL ;
    }
#endif
}




// Read/Evaluate/Print loop

/*
  repl - the Lisp Read/Evaluate/Print loop
*/
void repl (object *env) {
   while (1) {
    //randomSeed(micros());
    srand (time(NULL));

    #ifdef printfreespace
    if (!tstflag(NOECHO)) gc(NULL, env);
    pint(Freespace+1, pserial);
    #endif
    if (BreakLevel) {
      pfstring(" : ", pserial);
      pint(BreakLevel, pserial);
    }
    pserial('>'); pserial(' ');
    Context = NIL;
    object *line = read0(gserial);
    // Break handling
    if (BreakLevel) {
      if (line == nil || line == bsymbol(COLONC)) {
        pln(pserial); return;
      } else if (line == bsymbol(COLONA)) {
        pln(pserial); pln(pserial);
        GCStack = NULL;
        longjmp(*handler, 1);
      } else if (line == bsymbol(COLONB)) {
        pln(pserial); printbacktrace();
        line = bsymbol(NOTHING);
      }
    }
    if (line == (object *)KET) error2("unmatched right bracket");
    protect(line);
    pfl(pserial);
    line = eval(line, env);
    pfl(pserial);
    printobject(line, pserial);
    unprotect();
    pfl(pserial);
    pln(pserial);
  }
}






void execstring(char *str, object *env)
{
    object *line = lispstring (str);
    GlobalString = line ;
    GlobalStringIndex = 0;
    object *val = read0(gstr);
    LastChar = 0;
    push(line, GCStack);
    eval(val, env);
    pop(GCStack);
}


int load_image()
{
    mainprog_loadedflag = 1 ;
    if(file_name)
    {
        char image_name[256];

        strcpy(image_name, file_name) ;
        int len = strlen(file_name);
        char *img = &image_name[len-1] ;
        if(strchr(image_name,'.')!=NULL) while(*img !='.') img-- ;
        else img = &image_name[len] ;
        strcpy(img,".img");
        return loadimage(lispstring (image_name));
    }
    return 0 ;
}


/*void load_file(object *env)
{
     unsigned int res = f_open(&SDgfile, file_name, FA_OPEN_EXISTING | FA_READ ) ;
     if(res==FR_OK)
     {
    	 res = f_close(&SDgfile) ;


         mainprog_loadedflag = 1 ;

         char buffer[256];
         sprintf(buffer,
                "(defvar knowleges (load-program %c%s%c))",
                '"', file_name, '"') ;
         execstring(buffer, env);
         execstring("(eval knowleges)", env) ;
         execstring("(eval MainProgram)", env) ;
     }
}*/




/*
  loop - the Arduino IDE main execution loop
*/
void loop () {
  if (!setjmp(toplevel_handler)) {
#ifdef resetautorun
    volatile int autorun = 12; // Fudge to keep code size the same
#else
    volatile int autorun = 13;
#endif
    if (autorun == 12) autorunimage();
    //if(load_image()) setflag(LIBRARYLOADED);
  }
  //ulispreset();
  ulisperror();
  repl(NULL);
}





void ulispreset () {
  // Come here after error
  delay(100);
  //while (Serial.available()) Serial.read_r();
  clrflag(NOESC); BreakLevel = 0;
  for (int i=0; i<TRACEMAX; i++) TraceDepth[i] = 0;
#ifdef sdcardsupport
  /*if(fp_SDp) fclose(fp_SDp);
  fp_SDp = NULL ;
  if(fp_SDg) fclose(fp_SDg);
  fp_SDg = NULL ;*/
  fres = f_close(&SDgfile);
  fres = f_close(&SDpfile);
  f_unmount( "");
#endif

#ifdef lisplibrary
  if (!tstflag(LIBRARYLOADED))
  {
     setflag(LIBRARYLOADED);
     loadfromlibrary(NULL);
     //load_file(NULL) ;

  }
#endif

  //if(mainprog_loadedflag==0) load_file(NULL);


  #if defined(ULISP_WIFI)
  client.stop();
  #endif
}





void ulisperror () {
  // Come here after error
  delay(100); //while (Serial.available()) Serial.read();

  clrflag(NOESC); BreakLevel = 0; TraceStart = 0; TraceTop = 0;
  for (int i=0; i<TRACEMAX; i++) TraceDepth[i] = 0;

#ifdef sdcardsupport
  /*if(fp_SDp) fclose(fp_SDp);
  fp_SDp = NULL ;
  if(fp_SDg) fclose(fp_SDg);
  fp_SDg = NULL ;*/
  iFilesOpenedCounter = 0 ;
  f_unmount("");
  fres = f_close(&SDgfile);
  fres = f_close(&SDpfile);
#endif

#ifdef lisplibrary
  if (!tstflag(LIBRARYLOADED))
  {
     setflag(LIBRARYLOADED);
     loadfromlibrary(NULL);
     pserial('\n');
     //load_file(NULL) ;
  }
#endif
#if defined(ULISP_WIFI)
client.stop();
#endif
}


//#include "ulisp-extensions.cpp"
